import React from "react";
import { Container, Row, Col } from "react-bootstrap";

function AboutUsPage() {
  const headingStyle = {
    color: "#007BFF",
    textAlign: "center",
    marginTop: "20px",
    marginBottom: "20px",
  };

  const textStyle = {
    color: "#333",
    fontSize: "18px",
    lineHeight: "1.6",
    marginBottom: "30px",
  };

  return (
    <Container>
      <Row className="justify-content-md-center">
        <Col md="auto">
          <h1 style={headingStyle}>Про нас</h1>
          <p style={textStyle}>
            Ми - команда ентузіастів, що має за мету розвивати інтерес до
            програмування серед молодих талантів. Наша школа є інноваційним
            осередком, де ми вчимо дітей та підлітків основам програмування і
            комп'ютерної науки.
            <br />
            <br />
            У світі, де технології змінюються з космічною швидкістю, ми віримо,
            що навчання програмуванню вже змінюється у суттєвий спосіб. Ми
            прагнемо створити умови, де кожен учень зможе розкрити свій
            потенціал, стати творцем технологій та змінити світ навколо себе.
            Наша мета полягає не лише у передачі знань, а й у вихованні
            креативних, логічно мислячих і технологічно освічених особистостей.
            Ми ставимо акцент на практичних завданнях, проектах та командній
            роботі, щоб навчання було захопливим і цікавим для кожного учня.
            Наша команда вчителів - це досвідчені фахівці з програмування, які
            володіють глибокими знаннями в сфері інформаційних технологій. Вони
            створюють стимулююче навчальне середовище, де учні можуть
            покращувати свої навички та експериментувати з новими ідеями.
            <br />
            <br />
            Наші учні мають можливість вивчати різні мови програмування, такі як
            Python, Java, JavaScript, C++ та багато інших. Вони навчаються
            створювати веб-сайти, мобільні додатки, ігри та розв'язувати складні
            завдання, що розвивають їх творчість т а логічне мислення. Наша
            школа також організовує різноманітні заходи, включаючи хакатони,
            змагання з програмування та гостьові лекції від провідних
            IT-фахівців. Ми прагнемо забезпечити нашим учням не тільки
            академічні знання, а й можливості побачити, як комп'ютерна наука
            використовується на практиці та як вони можуть застосувати свої
            навички у реальному світі.
          </p>
        </Col>
      </Row>
    </Container>
  );
}

export default AboutUsPage;
